# -*- coding: utf-8 -*-
# 1. Вывести на экран "Курс Основы программирования начался".

print ("Курс Основы программирования начался")