# -- coding: utf-8 --
# Даны два целых числа A и B (при этом A ≤ B). Выведите все числа от A до B включительно.

def output():
    A = 3
    B = 6

    for i in range(A, B+1):
        print(i)
output()