public class HelloName {
    public static void main(String[] args) {
        System.out.println("Hello, " + (args.length > 0? args[0] : "world"));
    }
}

// Реализовать программу, получающую на вход в качестве аргумента имя человека и выводящую "Hello " + имя, в противном
// случае, если параметр не передавался, "Hello world".
