# -*- coding: utf-8 -*-
# 2. Вывести на экран остаток от деления 16823 * 12302 / 3092.

a = 16823
b = 12302
с = 3092
z = a*b%с
print (z)